[
    {
        "name":"Aishwarya H. Balwani",
        "imageUrl":"https://www.sfit.ac.in/images/Testimonials/AishwaryaB.jpg",
        "description":[
            "Georgia Institute of Technology"
        ],
        "testimonial":"SFIT always provided me with all the facilities and learning resources I needed, but more importantly, it has taught me resourcefulness and independence. Whether you’re into debates, robotics or entrepreneurship, there are opportunities aplenty for everyone. The students are a ball to be with, and the faculty members though strict at times, have the students’ best interests at heart. It wasn’t always an easy journey, but I can confidently say that I have emerged as a better, stronger and more competent individual at the end of it, and my four years at St. Francis Institute of Technnology have given me a lot to be thankful for, right from the people I met, the friends I made, to the lessons I learnt, the skills I developed and the many memories that I will cherish for life."
    },
    {
        "name":"Shyam C. Gawade",
        "imageUrl":"https://www.sfit.ac.in/images/Testimonials/ShyamG.jpg",
        "description":[
            "Software Test Engineer",
            "Infinite Computing Systems"
        ],
        "testimonial":"At St. Francis Institute of Technology, the teachers are always willing to help and support students with respect to their academics. The library is an excellent resource for students as it provides reference material not only with respect to their academics, but also for soft skills, programming languages, etc. to help them with their overall development and future career."
    },
    {
        "name":"Omkar Vaidya",
        "imageUrl":"https://www.sfit.ac.in/images/Testimonials/OmkarV.jpg",
        "description":[
            "MS in CS",
            "Univeristy Of Florida"
        ],
        "testimonial":"My journey at S. Francis Institute of Technology has been very credible and awesome all through my graduation years. I could feel my all round transformation , rich learning experiences which altogether added a different perspective and dimension to my personage . It feels great to be guided by amazing teachers who are luminaries in respective domains . They have always motivated and encouraged me to face the risks and failures with same spirit and instincts as we embrace success .I truly feel blessed as Alma mater of SFIT and pay my sincere thanks to my college for imbibing a making me the person I am today."
    },
    {
        "name":"Dheeraj Shetty",
        "imageUrl":"https://www.sfit.ac.in/images/Testimonials/DheerajS.jpg",
        "description":[
            "Analog Enginee",
            "INTEL, India"
        ],
        "testimonial":"Since the first moment I came to SFIT, I was met with nothing but energy and enthusiasm. The students are very welcoming and faculties are engaging. The study skills I acquired here were extremely beneficial. It’s not that they show you some secret, easier way to achieve high points, but they teach you how to manage your time properly and the areas that need to be prioritised. The experienced teachers pointed out common pitfalls and were easily approachable if you had difficulty understanding a concept. They do push you a bit harder which is great when you get the results you need. I made really good friends here and we have become a close knit family now. It’s because of them the place felt so homely. The SFIT experience was definitely one that I will never forget."
    },
    {
        "name":"Chintan Shah",
        "imageUrl":"https://www.sfit.ac.in/images/Testimonials/ChintanS.jpg",
        "description":[
            "Actifio Inc. Waltham, Massachusetts",
            "Junior Quality Assurance Analyst Intern"
        ],
        "testimonial":"I was a student at SFIT from 2011-2015 in the department of Information Technology. It was an amazing journey for these four years. Well, SFIT provides one of the best platforms to develop a base that is required for every individual to flourish in the future. This institute has a lot to offer. It is not only a study oriented educational home, but also takes care about the extra-curricular and co-curricular aspects. All that has been taught in these four years has been useful in some or the other way till date and has only made me climb the ladder of success. Every member working at SFIT which comprises of the HOD, the professors, lab assistants, all have been very helpful throughout the span of four years. Each and every member has played an incremental role for every student at SFIT, thus helping them achieve several milestones. On the whole these four year of engineering at SFIT have been a boon. It has been an excellent learning cycle and that is what has helped me reach to where I am. Thus it has been an all-round effort that has made possible to achieve such good results."
    },
    {
        "name":"Prachi Savant",
        "imageUrl":"https://www.sfit.ac.in/images/Testimonials/PrachiS.jpg",
        "description":[
            "MBA",
            "University Of Maryland"
        ],
        "testimonial":"SFIT has had a huge influence on my life. The college enabled me to identify my strengths and weaknesses with respect to choosing my career path. Apart from the professors and the infrastructure, the technical and cultural festivals make the students interact with other colleges."
    },
    {
        "name":"Karen D'souza",
        "imageUrl":"https://www.sfit.ac.in/images/Testimonials/KarenD.jpg",
        "description":[
            "Senior Software Engineer Illumina Inc, California"
        ],
        "testimonial":"Ah, where do I begin? The 5 years (4 as a student and 1 as a teacher) I've spent here have been absolutely wonderful. I think people are always looking for a sense of belonging, to be part of something big, something good. SFIT gave me that, whether it was organizing festivals, annual days or being responsible for teaching a bunch of third years what operating systems were all about. I'm so grateful to have been a part of such a great institution, to have had mentors who steered me in the right direction, to have met friends who continue to support me and to have had the opportunity to earn the respect of my students. Throughout the years I have come to appreciate the tremendous influence SFIT has had on me. It has shaped the strong fundamentals of my career and strong bonds of my life. No matter where I go, I'll always be a very proud SFITian."
    },
    {
        "name":"Navin Noronha",
        "imageUrl":"https://www.sfit.ac.in/images/Testimonials/NavinN.jpg",
        "description":[
            "Comedian/ Writer",
            "Improviser at the Etceteras",
            "Staff Editor at GraceNote"
        ],
        "testimonial":"I joined SFIT in 2010 after completing my diploma, and the first thing that stood out for me was the fact that the college is equal parts disciplinarian and fun. Not to mention the fact that I made some amazing friends during the course of my education. I like to believe that I have enjoyed a thorough collegiate experience. Though I would later end up not sticking to my majors, I still feel SFIT thought me a lot. There was also abundant time during the college fest days to explore extra-curricular avenues. This was the time I would most come alive. Being a part of the magazine publication team or hosting the annual day or putting a band together to perform on stage, I felt like I did a lot in a very short span of time. And that has translated to my real-world experiences as well. Engineering as a stream demands a lot from you. It can be a litmus test to gauge how well you can take your practical knowledge into the real world. I got a great job placement through college and so did a lot of my college mates, and even though I didn’t follow through and chose a different field of work, almost all my classmates have fared well in life. Some are even settled abroad after their masters. I feel proud to have associated with such able minds. To summarize my experience in SFIT, I’d say it has been more or less bittersweet. But if I could go back in time and change everything about my past, I still feel I would end up at St. Francis Institute of Technology, and willingly go through it all once again."
    },
    {
        "name":"Vipula D. Rawate",
        "imageUrl":"https://www.sfit.ac.in/images/Testimonials/VipulaR.jpg",
        "description":[
            "Ph.D. Student in Computer Science",
            "Rensselaer Polytechnic Institute"
        ],
        "testimonial":"My journey of three years at SFIT as a student and faculty has been a memorable experience. The most important values I learnt here are discipline and significance of time. During this period, I made some good friends and met some amazing people. Moreover, teaching staff and non-teaching staff were always helpful. Also, my father is very proud of me being a part of SFIT and I am grateful to the institute. It has definitely helped me reach my goal of pursuing higher studies. I hope that SFIT will just not grow but also bloom in every aspect in the years to come."
    },
    {
        "name":"Madan Panth",
        "imageUrl":"https://www.sfit.ac.in/images/Testimonials/MadanP.jpg",
        "testimonial":"I have always felt that I was so lucky to be a student at SFIT, and not at any other college. The thing I admire the most about SFIT is the support I received from everyone at the college. I wouldn't have been able to achieve what I have achieved without that caring environment.I can positively say that SFIT has made me a better person. It has helped me develop a positive attitude towards my studies and discover more about myself .I like the friendly atmosphere here and the fact the teachers are really close to the students. We are supported in our studies. Teachers are really kind and their way of teaching is really interesting. They motivate us to do our best. My grades have gone up starting from semester I to semester VIII and I am very glad to share my success by achieving First Rank in Final Year.The facilities at SFIT is impeccable and the variety of services available."
    },
    {
        "name":"Adhish Rane",
        "imageUrl":"https://www.sfit.ac.in/images/Testimonials/AdhishR.jpg",
        "description":[
            "Assistant Manager – Business Development,",
            "Customer Success Management & Strategic Alliances Zycus inc."
        ],
        "testimonial":"St. Francis Institute of Technology was a one storeyed building of an Engineering college when our class teacher from St. Francis D’ Assisi High school Mr. Mathews took us for a short trip around the campus when I was probably in my fifth standard. “It’s one of the most reputed engineering colleges in Mumbai and I hope someday some of you make it to this college if you choose to pursue a career in Engineering’, he said. A couple of years later, while filling the forms for the CAP rounds post CET with SFIT being one of the centres, I threw a glance at the vision statement which read ‘’To be a chrysalis where bright youngsters are transformed into technological entrepreneurs and innovative leaders of tomorrow’s world”. The vast plush green campus with a building that had undergone a massive transformation from what was my recollection of it when I first saw it was enough to have me hooked onto the possibility of graduating from this college. And with a series of circumstantial events well timed in their effect, that is exactly what happened. The college had an experienced faculty across all its streams that were trained not only to impart the knowledge of their respective subjects but also inculcate a sense of discipline amongst the students. Always open to solving queries and ever so approachable, many of the professors went out of their way to assist their students and many of them were responsible for honing me as a professional and as a person as well. Regular use of audio visual aids for teaching, well equipped laboratories, regular assignments followed by assessments went a long way in hardwiring subjects into our minds. Workshops, projects, Paper presentations, debate competitions and presentations kept us on our toes. But the most special thing about this college was the opportunities that it presented to me. I worked as a PR co-ordinator of the IETE before going on to head the council and it gave me the opportunity to learn about leadership and more importantly about management and professionalism. Marketing for the IETE and the Cultural – Technical Festivals made me develop a liking for the field of marketing, something I pursued a career in post my graduation and have been doing exceptionally well in. The debate team taught me to be more aware of the socio-political issues around me, while the magazine committee gave me a platform for expressing myself. Taking up Basketball as a sport and representing the college gave me a sense of pride and taking up to stage and performing at IRIS helped me overcome stage fright, while also giving the singer inside me a chance to come out. I attribute much of the success I have achieved in my life to these opportunities that I was given and the professors who went out of their way to help me grow and inculcated values that I’d take along with me wherever I go or whatever I do. The boisterous sea of colleagues who made this jouney even more worthwhile are worth the mention as well. It’s been 3 years post my graduation as I am penning this down, and as I look back at this journey of four years, it fills me with a sense of pride that I graduated from this institution. Maybe it really was the proverbial Chrysalis as the Vision statement said. I wish the institution, it’s faculty and all its students all the very best in all their endeavours."
    }
]